**Pandas: Exercise 1 â€“ Basic Pandas Operations**

In [1]:
import pandas as pd
import os

# Define the relative file path to the folder and the file name
# Note the forward slash before the folder name
folder_path = './data_lab7.2/'
file_name = 'occupation.csv'

# Combine them to create the full path string
file_path = os.path.join(folder_path, file_name)

# read csv
occupations_df = pd.read_csv(file_path, index_col=0)

# Display the first few rows to verify it loaded correctly
print(f"DataFrame successfully loaded from: {file_path}")
print(occupations_df.head(5))

DataFrame successfully loaded from: ./data_lab7.2/occupation.csv
         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [2]:
# Print out the first 25 rows

occupations_df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [ ]:
#  Print out the last 10 rows

occupations_df.tail(10)

In [20]:
#  What is the number of observations in the dataset?
print('Number of observations in the dataset is', len(occupations_df))

Number of observations in the dataset is 943

In [ ]:
# What is the number of columns in the dataset?
occupations_df.columns.size
#occupations_df.shape[1]

4

In [13]:
#Print out the name of all the columns

occupations_df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [14]:
# How is the dataset indexed?

occupations_df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [15]:
# What is the data type of each column?

occupations_df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [18]:
# Print out only the occupation column.

occupations_df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [27]:
# How many different occupations are there in this dataset

occupations_df['occupation'].nunique()
#occupations_df['occupation'].unique()

21

In [ ]:
# Print out the list of users aged 50 and above. How many of such users are there ?

print(f'Users aged >=50 {occupations_df.age >= 50}')
print(occupations_df[occupations_df.age >= 50])

Users aged >=50 user_id
1      False
2       True
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Name: age, Length: 943, dtype: bool